{
  "url": "https://learn.microsoft.com/en-us/minecraft/creator/documents/scriptversioning?view=minecraft-bedrock-stable#main",
  "title": "Script Module Versioning | Microsoft Learn",
  "paragraphs": [
    "Share via",
    "Note",
    "Access to this page requires authorization. You can try \nsigning in\n or \nchanging directories\n.",
    "Access to this page requires authorization. You can try \nchanging directories\n.",
    "Script Module Versioning",
    "2025-01-30",
    "In this article",
    "At its foundation, all script modules use a common version numbering scheme known as \nSemantic Versioning\n (or semver). Semantic versions use a numeric version number of [major].[minor].[patch] with an optional suffix. Note that this version number is not connected to the overall Minecraft version numbering scheme (for example, \n1.19.60\n); rather, these version numbers increment as changes occur to the API surface.",
    "Minecraft API modules currently operate on three tracks:",
    "a stable track (for example, version \n1.1.0\n)",
    "a beta track (for example, version \n1.3.0-beta\n)",
    "an internal track (for example, version \n1.4.0-internal\n)",
    "Also, as of 1.21.70 previews, we've also introduced 2.0.0-beta versions of scripting APIs. See the \nScripting V2.0.0 Overview\n for more on changes incorporated into 2.0.0.",
    "When specifying dependencies within \nmanifest.json\n of a behavior pack, it is important to consider the impact of the versions of APIs that you wish to use. Where possible, try to use stable track APIs.",
    "@minecraft/server\n script versions to product versions",
    "For reference, \n@minecraft/server\n is our most frequently updating script module. It tends to increment\nin version number with every major release of Minecraft. Here are the mappings of \n@minecraft/server\n version\nto Minecraft product version:",
    "Stable Track",
    "API modules in the stable track are numbered with a version number like \n1.1.0\n, and with no suffix on the end. These APIs are considered \"finished\" and should not change in functionality across releases where minor or patch versions are incremented. With stable APIs, Minecraft uses the rules of semantic versioning, which mean:",
    "Major version increments (for example, \n2.3.0\n -> \n3.0.0\n) imply changes that break backwards-compatibility, potentially in both API signature and functionality. Across major versions, a method signature might not change but it may work differently and impact the gameplay of worlds. Note that Minecraft may support multiple major versions of APIs in the future, so if a behavior pack has a dependency on an older major version of the API, it may still continue to work even if a newer major version of the script API module is available.",
    "Major version increments (for example, \n2.3.0\n -> \n3.0.0\n) imply changes that break backwards-compatibility, potentially in both API signature and functionality. Across major versions, a method signature might not change but it may work differently and impact the gameplay of worlds. Note that Minecraft may support multiple major versions of APIs in the future, so if a behavior pack has a dependency on an older major version of the API, it may still continue to work even if a newer major version of the script API module is available.",
    "Minor and patch version increments could imply new functionality and API signature additions, but should be backwards-compatible within the same major version.",
    "Minor and patch version increments could imply new functionality and API signature additions, but should be backwards-compatible within the same major version.",
    "This implies that as minor versions increment, and even if additional \"minor releases\" feature new APIs, they must be fully backwards compatible with earlier minor versions of the API. For example, if a script module has a dependency on version \n1.3.0\n of the \n@minecraft/server\n API, it may actually have that dependency fulfilled with \n1.8.0\n of the \n@minecraft/server\n - and those script modules should continue to function as expected. For those familiar with NPM semantic versioning, this is similar to the \n^\n signifier within version dependencies.",
    "Important",
    "As you share or publish behavior packs that use stable APIs, please base your dependencies for APIs on the latest and highest version number that is supported within Minecraft at the time of your release.",
    "As of version 1.19.70, only \n@minecraft/server\n has APIs that are in the stable track. See the following objects specifically:",
    "World",
    "Dimension",
    "Entity",
    "Note that only a subset of the members of these types are currently exposed in the stable track.",
    "Beta Track",
    "API modules in the beta track are labeled with the \"-beta\" suffix - for example, \n1.2.0-beta\n. Beta APIs do not follow the rules of semantic versioning. With beta APIs, no backwards compatibility is implied, and even minor version increments can include backwards-compatibility breaking changes like the removal of properties or methods. Moreover, with every major release of Minecraft, it is likely that several \n-beta\n modules will increment their version number (for example, from \n1.2.0-beta\n to \n1.3.0-beta\n) without having an automatic upgrade from the old \n-beta\n version to the next. As a consequence, you may need to update the version number of \nmanifest.json\n dependencies at every major release if you are using \n-beta\n APIs.",
    "Important",
    "In order to use -beta APIs, you must enable the \"Beta APIs\" experiment within worlds that use these behavior packs.",
    "Internal Track",
    "Internal APIs are not functional or supported for use in custom behavior packs. Their API signatures might change at any time.",
    "Using versioned type definitions when scripting",
    "For the definitive resource on APIs and types that are exposed in various versions, consider using the type definitions available through \nnpm\n at \nnpmjs.com\n. The \n@minecraft/server\n definitions contain different variants of type definitions for stable and beta tracks, as well as across both main and preview releases of Minecraft Bedrock Edition. See more on how to use these type definitions in \nthis article",
    "Feedback",
    "Was this page helpful?",
    "Additional resources"
  ],
  "code_blocks": []
}